using System;
using System.Collections.Generic;
using System.Linq;
using System.Security.Cryptography.X509Certificates;
using System.Text;
using System.Threading.Tasks;

namespace Laba3
{
    internal class Dish
    {
        public string Name { get; set; }
        public string Description { get; set; }
        public double Price { get; set; }
        public double Calories { get; set; }
        public ResTypes Type { get; set; }
        public Dish(string name, string description, double price, double calories, ResTypes type)
        {
            Name = name;
            Description = description;
            Price = price;
            Calories = calories;
            Type = type;
        }
        public static List<Dish> dishes = new List<Dish>
        {
            new Dish("Салат Цезар", "основними складниками салату є " +
                "пшеничні крутони (грінки), листя салату-ромен і " +
                "тертий пармезан, заправлені соусом.", 100, 66, ResTypes.ГромадськеХарчування),
            new Dish("Вареники", "українська національна страва у вигляді відвареного прісного тіста і начинки з картоплі, м'яса, грибів, овочів, фруктів, ягід та сиру.", 150, 875, ResTypes.ГромадськеХарчування),
            new Dish("Круассан з яловичиною гриль", "круасан, яловичина гриль, салат айсберг, помідор, маринована цибуля, соус сацебелі, соус класичний", 139, 453, ResTypes.ГромадськеХарчування),
            new Dish("Борщ", "українська рідка страва, що вариться з посічених буряків, капусти з додатком картоплі, квасолі та різних приправ. Червоний борщ зі сметаною та кропом.", 120, 108, ResTypes.ГромадськеХарчування),
            new Dish("Круассан Вегетаріанський", "соус песто, рукола, помідор, сир моцарела, в'ялені томати", 105, 400, ResTypes.ГромадськеХарчування),
            new Dish("Сирники", "підсмажені на вершковому маслі (чи на олії) млинці з домашнього сиру та борошна, з додаванням яєць, а також солі, цукру і/або поташу", 100, 430, ResTypes.ГромадськеХарчування),
            new Dish("Круассан Галицький", "огірок, помідор, курка, гриби, салат, соус гірчичний", 89, 295, ResTypes.ГромадськеХарчування),
            new Dish("Круассан З тунцем", "зелена цибуля, тунець, яєчня, лимон, помідор, салат, соус класичний", 105, 304, ResTypes.ГромадськеХарчування),

            new Dish("БігТейсті", "Два біфштекси з натуральної яловичини, цибуля, маринований огірок, сир “Чеддер”, свіжий салат, заправлені спеціальним соусом, у булочці з насінням сезаму.", 120, 526, ResTypes.Фастфуд),
            new Dish("Чізбургер", "Біфштекс із натуральної яловичини, шматочок сиру “Чеддер”, шматочок маринованого огірка та цибуля, заправлені гірчицею і кетчупом, у булочці з пшеничного борошна.", 75, 298, ResTypes.Фастфуд),
            new Dish("Морозиво Флурі з полуницею", "Морозиво із полуничною поливою і КітКат", 69, 318, ResTypes.Фастфуд),
            new Dish("Твістер оригінальний", "Шматочки курячого філе в оригінальній паніровці разом із листям салату, томатами та майонезом, що загорнуті в гарячу тортілью.", 110, 512, ResTypes.Фастфуд),
            new Dish("Меню з нагетсами", "9 соковитих нагетсів, хрустка картопелька фрі та газований напій 0.5л!", 195, 1350, ResTypes.Фастфуд),
            new Dish("Меню з крильцями", "5 соковитих крилець у гострій паніровці, хруста картопелька фрі та газований напій 0.5л!", 195, 1550, ResTypes.Фастфуд),
            new Dish("Whooper", "Наш справжній фаворит - легендарний WHOPPER®, а в ньому приготована на вогні 100% яловичина з соковитими скибочками томату, свіжим нарізаним листковим салатом, густим майонезом, кетчупом, хрусткими маринованими огірками і кільцями цибульки на неколечку цибульки", 149, 679, ResTypes.Фастфуд),
            new Dish("Chicken Tendercrisp", "Chicken Tendercrisp® бургер – це найніжніше куряче філе, покрите хрумкою кукурудзяною паніровкою та приправлене нашою особливою сумішшю прянощів. Подається зі свіжим хрустким салатом, соковитими скибочками томату та майонезом на підрум'яненій булочці", 189, 648, ResTypes.Фастфуд),
            new Dish("Cheesy Onion Fries", "Ми посипали нашу знамениту картопля фрі хрустким смаженим цибулькою і щедро полили порцією сирного соусу. Відмінне доповнення до основної страви, але і гарна як закуска або легке перекушування", 129, 747, ResTypes.Фастфуд),

            new Dish("Ice лате", "це саме те, що здатне охолодити в літню спеку, адже напій містить каву, холодне молоко та лід. А тонких відтінків смаку можна додати за допомогою сиропів та топінгів.", 64, 440, ResTypes.Кафе),
            new Dish("Мохіто", "традиційно складається з п'яти інгредієнтів: ром, цукор, лайм, газована вода і м'ята. Об'єднання освіжаючого цитруса з м'ятою, які, додавалися в ром, щоб приглушити міцність останнього, зробила цей коктейль одним з найпопулярніших літніх напоїв", 79, 110, ResTypes.Кафе),
            new Dish("Лимонад маракуя", "Насолоджуйся міксом з Манго та Маракуя. Найпопулярніший мікс серед екзотичних уподобань. Пюре Манго в комбінаціях із соком Маракуї створюють чудову композицію - легкий смак стиглих тропічних фруктів, аромат Королівського Манго.", 79, 119, ResTypes.Кафе),
            new Dish("Смузі банан-полуниця", "густий вітамінний напій, виготовлений з ягід та фруктів, багатий на вітаміни, мінерали та антиоксиданти, що містяться у свіжій сировині.", 99, 149, ResTypes.Кафе),
            new Dish("Spindrift Raspberry Lime Sparkling Water", "Ми хотіли, щоб наша газована вода Raspberry Lime справді нагадувала смак малини та лайму, тому ми подрібнили в неї справжню малину та лайм. Результат – легкий, яскравий і неймовірно освіжаючий.", 69, 119, ResTypes.Кафе),

            new Dish("Піца з в’яленими томатами та куркою", "Курка, Моцарела, Фета, Шпинат, Соус Альфредо, В’ялені томати", 199, 289, ResTypes.Піцерія),
            new Dish("Піца солодка", "Моцарела, Банан, Мигдаль, Шоко паста, Солодкий соус, Вишневий бортик", 286, 318, ResTypes.Піцерія),
            new Dish("Піца з грушею і блакитним сиром", "Моцарела, Бергадер Блю, Соус Альфредо, Груша", 249, 310, ResTypes.Піцерія),
            new Dish("Піца Пепероні з томатами", "Пепероні, Моцарела, Помідори, Соус Барбекю", 240, 278, ResTypes.Піцерія),
            new Dish("Піца Маргарита", "Моцарела(x2), Соус Domino's (подвійна порція моцарели)", 275, 298, ResTypes.Піцерія),
        };

    }
    
}
